name: "mask_rnn_predict"
op {
  input: "input_blob"
  output: "MaskRNN/inputs"
  output: "MaskRNN/inputs_last"
  output: "MaskRNN/inputs_mean"
  output: "MaskRNN/masks"
  output: "MaskRNN/intervals"
  name: ""
  type: "Split"
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "MaskRNN/intervals"
  input: "input_decay/MaskRNN/intervals_fc_w"
  input: "input_decay/MaskRNN/intervals_fc_b"
  output: "input_decay/MaskRNN/intervals_fc"
  name: ""
  type: "FC"
  arg {
    name: "use_cudnn"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "input_decay/MaskRNN/intervals_fc"
  output: "input_decay/MaskRNN/ZEROS"
  name: ""
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0.0
  }
}
op {
  input: "input_decay/MaskRNN/intervals_fc"
  input: "input_decay/MaskRNN/ZEROS"
  output: "input_decay/MaskRNN/max_intervals_fc"
  name: ""
  type: "Max"
}
op {
  input: "input_decay/MaskRNN/max_intervals_fc"
  output: "input_decay/MaskRNN/neg_max_interval_fc"
  name: ""
  type: "Negative"
}
op {
  input: "input_decay/MaskRNN/neg_max_interval_fc"
  output: "input_decay/MaskRNN/decays"
  name: ""
  type: "Exp"
}
op {
  input: "MaskRNN/masks"
  output: "MaskRNN/ONES"
  name: ""
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1.0
  }
}
op {
  input: "MaskRNN/ONES"
  input: "MaskRNN/masks"
  output: "MaskRNN/one_minus_masks"
  name: ""
  type: "Sub"
}
op {
  input: "MaskRNN/ONES"
  input: "input_decay/MaskRNN/decays"
  output: "MaskRNN/one_minus_decays"
  name: ""
  type: "Sub"
}
op {
  input: "MaskRNN/masks"
  input: "MaskRNN/inputs"
  output: "MaskRNN/masked_inputs_1"
  name: ""
  type: "Mul"
}
op {
  input: "input_decay/MaskRNN/decays"
  input: "MaskRNN/inputs_last"
  output: "MaskRNN/decayed_inputs_last"
  name: ""
  type: "Mul"
}
op {
  input: "MaskRNN/one_minus_masks"
  input: "MaskRNN/decayed_inputs_last"
  output: "MaskRNN/masked_decayed_inputs_last"
  name: ""
  type: "Mul"
}
op {
  input: "MaskRNN/one_minus_decays"
  input: "MaskRNN/inputs_mean"
  output: "MaskRNN/decayed_inputs_mean"
  name: ""
  type: "Mul"
}
op {
  input: "MaskRNN/one_minus_masks"
  input: "MaskRNN/decayed_inputs_mean"
  output: "MaskRNN/masked_decayed_inputs_mean"
  name: ""
  type: "Mul"
}
op {
  input: "MaskRNN/masked_decayed_inputs_last"
  input: "MaskRNN/masked_decayed_inputs_mean"
  output: "MaskRNN/sum_input_last_mean"
  name: ""
  type: "Add"
}
op {
  input: "MaskRNN/masked_inputs_1"
  input: "MaskRNN/sum_input_last_mean"
  output: "MaskRNN/masked_inputs"
  name: ""
  type: "Add"
}
op {
  input: "MaskRNN/masked_inputs"
  input: "MaskRNN/masked_inputs_hidden_w"
  input: "MaskRNN/masked_inputs_hidden_b"
  output: "MaskRNN/masked_inputs_hidden"
  name: ""
  type: "FC"
  arg {
    name: "use_cudnn"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "MaskRNN/masks"
  input: "MaskRNN/masks_hidden_w"
  input: "MaskRNN/masks_hidden_b"
  output: "MaskRNN/masks_hidden"
  name: ""
  type: "FC"
  arg {
    name: "use_cudnn"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "MaskRNN/masks_hidden"
  input: "MaskRNN/masked_inputs_hidden"
  output: "MaskRNN/inputs_masks_blob"
  name: ""
  type: "Add"
}
op {
  input: "MaskRNN/inputs_masks_blob"
  input: "hidden_init"
  input: "MaskRNN/reset_gate_t_w"
  input: "MaskRNN/reset_gate_t_b"
  input: "MaskRNN/update_gate_t_w"
  input: "MaskRNN/update_gate_t_b"
  input: "MaskRNN/output_gate_t_w"
  input: "MaskRNN/output_gate_t_b"
  input: "seq_lengths"
  output: "MaskRNN/hidden_t_all"
  output: "MaskRNN/hidden_t_last"
  output: "MaskRNN/step_workspaces"
  name: ""
  type: "RecurrentNetwork"
  arg {
    name: "outputs_with_grads"
    ints: 0
  }
  arg {
    name: "link_internal"
    strings: "MaskRNN/hidden_t_prev"
    strings: "MaskRNN/hidden_t"
    strings: "input_t"
  }
  arg {
    name: "alias_dst"
    strings: "MaskRNN/hidden_t_all"
    strings: "MaskRNN/hidden_t_last"
  }
  arg {
    name: "recompute_blobs_on_backward"
  }
  arg {
    name: "timestep"
    s: "timestep"
  }
  arg {
    name: "backward_link_external"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states_grad"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states_grad"
    strings: "MaskRNN/inputs_masks_blob_grad"
  }
  arg {
    name: "link_external"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states"
    strings: "MaskRNN/inputs_masks_blob"
  }
  arg {
    name: "link_offset"
    ints: 0
    ints: 1
    ints: 0
  }
  arg {
    name: "alias_offset"
    ints: 1
    ints: -1
  }
  arg {
    name: "recurrent_states"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states"
  }
  arg {
    name: "backward_link_offset"
    ints: 1
    ints: 0
    ints: 0
  }
  arg {
    name: "param_grads"
    strings: "MaskRNN/reset_gate_t_w_grad"
    strings: "MaskRNN/reset_gate_t_b_grad"
    strings: "MaskRNN/update_gate_t_w_grad"
    strings: "MaskRNN/update_gate_t_b_grad"
    strings: "MaskRNN/output_gate_t_w_grad"
    strings: "MaskRNN/output_gate_t_b_grad"
  }
  arg {
    name: "backward_link_internal"
    strings: "MaskRNN/hidden_t_grad"
    strings: "MaskRNN/hidden_t_prev_grad"
    strings: "input_t_grad"
  }
  arg {
    name: "param"
    ints: 2
    ints: 3
    ints: 4
    ints: 5
    ints: 6
    ints: 7
  }
  arg {
    name: "step_net"
    s: "name: \"MaskRNN\"\nop {\n  input: \"input_t\"\n  output: \"MaskRNN/input_t_reset\"\n  output: \"MaskRNN/input_t_update\"\n  output: \"MaskRNN/input_t_output\"\n  name: \"\"\n  type: \"Split\"\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n}\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/reset_gate_t_w\"\n  input: \"MaskRNN/reset_gate_t_b\"\n  output: \"MaskRNN/reset_gate_t\"\n  name: \"\"\n  type: \"FC\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n}\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/update_gate_t_w\"\n  input: \"MaskRNN/update_gate_t_b\"\n  output: \"MaskRNN/update_gate_t\"\n  name: \"\"\n  type: \"FC\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n}\nop {\n  input: \"MaskRNN/reset_gate_t\"\n  input: \"MaskRNN/input_t_reset\"\n  output: \"MaskRNN/reset_gate_t\"\n  name: \"\"\n  type: \"Sum\"\n}\nop {\n  input: \"MaskRNN/reset_gate_t\"\n  output: \"MaskRNN/reset_gate_t_sigmoid\"\n  name: \"\"\n  type: \"Sigmoid\"\n}\nop {\n  input: \"MaskRNN/reset_gate_t_sigmoid\"\n  input: \"MaskRNN/hidden_t_prev\"\n  output: \"MaskRNN/modified_hidden_t_prev\"\n  name: \"\"\n  type: \"Mul\"\n}\nop {\n  input: \"MaskRNN/modified_hidden_t_prev\"\n  input: \"MaskRNN/output_gate_t_w\"\n  input: \"MaskRNN/output_gate_t_b\"\n  output: \"MaskRNN/output_gate_t\"\n  name: \"\"\n  type: \"FC\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n}\nop {\n  input: \"MaskRNN/update_gate_t\"\n  input: \"MaskRNN/input_t_update\"\n  output: \"MaskRNN/update_gate_t\"\n  name: \"\"\n  type: \"Sum\"\n}\nop {\n  input: \"MaskRNN/output_gate_t\"\n  input: \"MaskRNN/input_t_output\"\n  output: \"MaskRNN/output_gate_t\"\n  name: \"\"\n  type: \"Sum\"\n}\nop {\n  input: \"MaskRNN/reset_gate_t\"\n  input: \"MaskRNN/update_gate_t\"\n  input: \"MaskRNN/output_gate_t\"\n  output: \"MaskRNN/gates_t\"\n  output: \"MaskRNN/_gates_t_concat_dims\"\n  name: \"\"\n  type: \"Concat\"\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n}\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/gates_t\"\n  input: \"seq_lengths\"\n  input: \"timestep\"\n  output: \"MaskRNN/hidden_t\"\n  name: \"\"\n  type: \"GRUUnit\"\n  arg {\n    name: \"drop_states\"\n    i: 0\n  }\n  arg {\n    name: \"forget_bias\"\n    f: 0.0\n  }\n}\ntype: \"rnn\"\nexternal_input: \"input_t\"\nexternal_input: \"timestep\"\nexternal_input: \"MaskRNN/hidden_t_prev\"\nexternal_input: \"MaskRNN/reset_gate_t_w\"\nexternal_input: \"MaskRNN/reset_gate_t_b\"\nexternal_input: \"MaskRNN/update_gate_t_w\"\nexternal_input: \"MaskRNN/update_gate_t_b\"\nexternal_input: \"MaskRNN/output_gate_t_w\"\nexternal_input: \"MaskRNN/output_gate_t_b\"\nexternal_input: \"seq_lengths\"\nexternal_output: \"MaskRNN/hidden_t\"\n"
  }
  arg {
    name: "backward_step_net_"
    s: "name: \"RecurrentBackwardStep\"\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/gates_t\"\n  input: \"seq_lengths\"\n  input: \"timestep\"\n  input: \"MaskRNN/hidden_t\"\n  input: \"MaskRNN/hidden_t_grad\"\n  output: \"MaskRNN/hidden_t_prev_grad\"\n  output: \"MaskRNN/gates_t_grad\"\n  name: \"\"\n  type: \"GRUUnitGradient\"\n  arg {\n    name: \"drop_states\"\n    i: 0\n  }\n  arg {\n    name: \"forget_bias\"\n    f: 0.0\n  }\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/gates_t_grad\"\n  input: \"MaskRNN/_gates_t_concat_dims\"\n  output: \"MaskRNN/reset_gate_t_grad\"\n  output: \"MaskRNN/update_gate_t_grad\"\n  output: \"MaskRNN/output_gate_t_grad\"\n  name: \"\"\n  type: \"Split\"\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/modified_hidden_t_prev\"\n  input: \"MaskRNN/output_gate_t_w\"\n  input: \"MaskRNN/output_gate_t_grad\"\n  output: \"MaskRNN/output_gate_t_w_grad\"\n  output: \"MaskRNN/output_gate_t_b_grad\"\n  output: \"MaskRNN/modified_hidden_t_prev_grad\"\n  name: \"\"\n  type: \"FCGradient\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/modified_hidden_t_prev_grad\"\n  input: \"MaskRNN/hidden_t_prev\"\n  output: \"MaskRNN/reset_gate_t_sigmoid_grad\"\n  name: \"\"\n  type: \"Mul\"\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/modified_hidden_t_prev_grad\"\n  input: \"MaskRNN/reset_gate_t_sigmoid\"\n  output: \"_MaskRNN/hidden_t_prev_grad_autosplit_0\"\n  name: \"\"\n  type: \"Mul\"\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/reset_gate_t_sigmoid\"\n  input: \"MaskRNN/reset_gate_t_sigmoid_grad\"\n  output: \"_MaskRNN/reset_gate_t_grad_autosplit_0\"\n  name: \"\"\n  type: \"SigmoidGradient\"\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/reset_gate_t_grad\"\n  input: \"_MaskRNN/reset_gate_t_grad_autosplit_0\"\n  output: \"MaskRNN/reset_gate_t_grad\"\n  name: \"\"\n  type: \"Sum\"\n}\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/update_gate_t_w\"\n  input: \"MaskRNN/update_gate_t_grad\"\n  output: \"MaskRNN/update_gate_t_w_grad\"\n  output: \"MaskRNN/update_gate_t_b_grad\"\n  output: \"_MaskRNN/hidden_t_prev_grad_autosplit_1\"\n  name: \"\"\n  type: \"FCGradient\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/hidden_t_prev\"\n  input: \"MaskRNN/reset_gate_t_w\"\n  input: \"MaskRNN/reset_gate_t_grad\"\n  output: \"MaskRNN/reset_gate_t_w_grad\"\n  output: \"MaskRNN/reset_gate_t_b_grad\"\n  output: \"_MaskRNN/hidden_t_prev_grad_autosplit_2\"\n  name: \"\"\n  type: \"FCGradient\"\n  arg {\n    name: \"use_cudnn\"\n    i: 1\n  }\n  arg {\n    name: \"cudnn_exhaustive_search\"\n    i: 0\n  }\n  arg {\n    name: \"order\"\n    s: \"NCHW\"\n  }\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n  is_gradient_op: true\n}\nop {\n  input: \"MaskRNN/hidden_t_prev_grad\"\n  input: \"_MaskRNN/hidden_t_prev_grad_autosplit_0\"\n  input: \"_MaskRNN/hidden_t_prev_grad_autosplit_1\"\n  input: \"_MaskRNN/hidden_t_prev_grad_autosplit_2\"\n  output: \"MaskRNN/hidden_t_prev_grad\"\n  name: \"\"\n  type: \"Sum\"\n}\nop {\n  input: \"MaskRNN/reset_gate_t_grad\"\n  input: \"MaskRNN/update_gate_t_grad\"\n  input: \"MaskRNN/output_gate_t_grad\"\n  output: \"input_t_grad\"\n  output: \"_input_t_grad_dims\"\n  name: \"\"\n  type: \"Concat\"\n  arg {\n    name: \"axis\"\n    i: 2\n  }\n  is_gradient_op: true\n}\ntype: \"simple\"\nexternal_input: \"MaskRNN/_gates_t_concat_dims\"\nexternal_input: \"MaskRNN/reset_gate_t_sigmoid\"\nexternal_input: \"MaskRNN/modified_hidden_t_prev\"\nexternal_input: \"MaskRNN/gates_t\"\nexternal_input: \"MaskRNN/hidden_t_grad\"\nexternal_input: \"input_t\"\nexternal_input: \"timestep\"\nexternal_input: \"MaskRNN/hidden_t_prev\"\nexternal_input: \"MaskRNN/reset_gate_t_w\"\nexternal_input: \"MaskRNN/reset_gate_t_b\"\nexternal_input: \"MaskRNN/update_gate_t_w\"\nexternal_input: \"MaskRNN/update_gate_t_b\"\nexternal_input: \"MaskRNN/output_gate_t_w\"\nexternal_input: \"MaskRNN/output_gate_t_b\"\nexternal_input: \"seq_lengths\"\nexternal_input: \"MaskRNN/hidden_t\"\n"
  }
  arg {
    name: "alias_src"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states"
    strings: "MaskRNN/MaskRNN/hidden_t_prev_states"
  }
  arg {
    name: "initial_recurrent_state_ids"
    ints: 1
  }
}
op {
  input: "MaskRNN/hidden_t_all"
  input: "mask_rnn_blob_0_w"
  input: "mask_rnn_blob_0_b"
  output: "mask_rnn_blob_0"
  name: ""
  type: "FC"
  arg {
    name: "use_cudnn"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "MaskRNN/hidden_t_all"
  input: "mask_rnn_blob_1_w"
  input: "mask_rnn_blob_1_b"
  output: "mask_rnn_blob_1"
  name: ""
  type: "FC"
  arg {
    name: "use_cudnn"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "axis"
    i: 2
  }
}
op {
  input: "mask_rnn_blob_1"
  output: "class_softmax_output"
  name: ""
  type: "Softmax"
  arg {
    name: "axis"
    i: 2
  }
}
external_input: "MaskRNN/output_gate_t_w"
external_input: "MaskRNN/reset_gate_t_b"
external_input: "mask_rnn_blob_0_w"
external_input: "input_blob"
external_input: "input_decay/MaskRNN/intervals_fc_b"
external_input: "MaskRNN/reset_gate_t_w"
external_input: "seq_lengths"
external_input: "input_decay/MaskRNN/intervals_fc_w"
external_input: "MaskRNN/update_gate_t_b"
external_input: "MaskRNN/masks_hidden_b"
external_input: "MaskRNN/masked_inputs_hidden_w"
external_input: "mask_rnn_blob_1_b"
external_input: "MaskRNN/update_gate_t_w"
external_input: "MaskRNN/masks_hidden_w"
external_input: "MaskRNN/output_gate_t_b"
external_input: "mask_rnn_blob_1_w"
external_input: "mask_rnn_blob_0_b"
external_input: "MaskRNN/masked_inputs_hidden_b"
external_input: "hidden_init"
external_output: "mask_rnn_blob_0"
external_output: "class_softmax_output"
